In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 2.1 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [2]:
%load_ext sql

In [3]:
%%sql sqlite:///trial.db

In [4]:
%%sql CREATE TABLE Worker(
    worker_ID INT NOT NULL PRIMARY KEY,
    FIRST_NAME TEXT(25),
    LAST_NAME TEXT(25),
    SALARY INT(15),
    JOINING_DATE DATETIME,
    DEPARTMENT TEXT(25)
);

 * sqlite:///trial.db
Done.

[]

In [6]:
%%sql CREATE TABLE Bonus(
    Worker_REF_ID INT,
    BONUS_AMOUNT INT(10),
    BONUS_DATE DATETIME,
    FOREIGN KEY (WORKER_REF_ID)
     REFERENCES Worker(WORKER_ID)
       ON DELETE CASCADE
);

 * sqlite:///trial.db
Done.

[]

In [11]:
%%sql CREATE TABLE Title(
   WORKER_REF_ID INT,
   WORKER_TITLE CHAR(25),
   AFFECTED_FROM DATETIME,
    FOREIGN KEY (WORKER_REF_ID)
     REFERENCES worker(WORKER_ID)
      ON DELETE CASCADE
);

 * sqlite:///trial.db
Done.

[]

In [7]:
%%sql INSERT INTO Worker
(WORKER_ID, FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT) VALUES
  (001, 'Jane', 'Nyamai', 100000, '12-02-24 09.00.00', 'HR'),
  (002, 'Victor', 'Korat', 80000, '11-04-23 09.00.00', 'Account'),
  (003, 'James', 'Tabuke', 300000, '13-05-20 09.00.00', 'Admin'),
  (004, 'Amara', 'tahid', 500000, '14-02-20 09.00.00', 'HR'),
  (005, 'John', 'Doe', 500000, '14-07-18 09.00.00', 'Admin'),
  (006, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
  (007, 'Satish', 'Kumar', 75000, '12-08-21 09.00.00', 'Account'),
  (008, 'Vivek', 'Bhati', 90000, '14-09-15 09.00.00', 'Admin');

 * sqlite:///trial.db
8 rows affected.

[]

In [8]:
%%sql INSERT INTO Bonus
  (WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE) VALUES
  (001, 5000, '16-02-20'),
  (002, 3000, '16=06-11'),
  (003, 4000, '16-02-16'),
  (004, 4500, '16-02-20'),
  (005, 3500, '16-07-23');

 * sqlite:///trial.db
5 rows affected.

[]

In [12]:
%%sql INSERT INTO Title
 (WORKER_REF_ID, WORKER_TITLE, AFFECTED_FROM) VALUES
(001, 'Manager', '2016-02-20 00.00.00'),
(002, 'Manager', '2016-06-11 00.00.00'),
(008, 'Executive', '2016-06-11 00.00.00'),
(005, 'Executive', '2016-06-11 00.00.00'),
(004, 'ASS. Manager', '2016-06-11 00.00.00'),
(007, 'Executive', '2016-06-11 00.00.00'),
(006, 'Lead', '2016-06-11 00.00.00'),
(003, 'Lead', '2016-06-11 00.00.00');

 * sqlite:///trial.db
8 rows affected.

[]

In [13]:
%sql SELECT * FROM Worker

 * sqlite:///trial.db
Done.

[(1, 'Jane', 'Nyamai', 100000, '12-02-24 09.00.00', 'HR'),
 (2, 'Victor', 'Korat', 80000, '11-04-23 09.00.00', 'Account'),
 (3, 'James', 'Tabuke', 300000, '13-05-20 09.00.00', 'Admin'),
 (4, 'Amara', 'tahid', 500000, '14-02-20 09.00.00', 'HR'),
 (5, 'John', 'Doe', 500000, '14-07-18 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '12-08-21 09.00.00', 'Account'),
 (8, 'Vivek', 'Bhati', 90000, '14-09-15 09.00.00', 'Admin')]

In [14]:
%sql SELECT * FROM Bonus

 * sqlite:///trial.db
Done.

[(1, 5000, '16-02-20'),
 (2, 3000, '16=06-11'),
 (3, 4000, '16-02-16'),
 (4, 4500, '16-02-20'),
 (5, 3500, '16-07-23')]

In [15]:
%sql SELECT * FROM Title

 * sqlite:///trial.db
Done.

[(1, 'Manager', '2016-02-20 00.00.00'),
 (2, 'Manager', '2016-06-11 00.00.00'),
 (8, 'Executive', '2016-06-11 00.00.00'),
 (5, 'Executive', '2016-06-11 00.00.00'),
 (4, 'ASS. Manager', '2016-06-11 00.00.00'),
 (7, 'Executive', '2016-06-11 00.00.00'),
 (6, 'Lead', '2016-06-11 00.00.00'),
 (3, 'Lead', '2016-06-11 00.00.00')]

In [16]:
%sql SELECT WORKER_REF_ID, WORKER_TITLE FROM Title

 * sqlite:///trial.db
Done.

[(1, 'Manager'),
 (2, 'Manager'),
 (8, 'Executive'),
 (5, 'Executive'),
 (4, 'ASS. Manager'),
 (7, 'Executive'),
 (6, 'Lead'),
 (3, 'Lead')]

In [17]:
%sql SELECT * FROM Title where WORKER_TITLE == 'Lead';

 * sqlite:///trial.db
Done.

[(6, 'Lead', '2016-06-11 00.00.00'), (3, 'Lead', '2016-06-11 00.00.00')]

In [18]:
%sql SELECT * FROM Bonus ORDER BY BONUS_AMOUNT;

 * sqlite:///trial.db
Done.

[(2, 3000, '16=06-11'),
 (5, 3500, '16-07-23'),
 (3, 4000, '16-02-16'),
 (4, 4500, '16-02-20'),
 (1, 5000, '16-02-20')]

In [19]:
%sql SELECT * FROM Bonus ORDER BY BONUS_AMOUNT ASC;

 * sqlite:///trial.db
Done.

[(2, 3000, '16=06-11'),
 (5, 3500, '16-07-23'),
 (3, 4000, '16-02-16'),
 (4, 4500, '16-02-20'),
 (1, 5000, '16-02-20')]

In [20]:
%sql SELECT * FROM Worker ORDER BY (JOINING_DATE) DESC;

 * sqlite:///trial.db
Done.

[(8, 'Vivek', 'Bhati', 90000, '14-09-15 09.00.00', 'Admin'),
 (5, 'John', 'Doe', 500000, '14-07-18 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (4, 'Amara', 'tahid', 500000, '14-02-20 09.00.00', 'HR'),
 (3, 'James', 'Tabuke', 300000, '13-05-20 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '12-08-21 09.00.00', 'Account'),
 (1, 'Jane', 'Nyamai', 100000, '12-02-24 09.00.00', 'HR'),
 (2, 'Victor', 'Korat', 80000, '11-04-23 09.00.00', 'Account')]

In [21]:
%sql SELECT WORKER_TITLE, COUNT(*) AS "Employees" FROM Title GROUP BY WORKER_TITLE;

 * sqlite:///trial.db
Done.

[('ASS. Manager', 1), ('Executive', 3), ('Lead', 2), ('Manager', 2)]

In [22]:
%sql SELECT WORKER_REF_ID, SUM(BONUS_AMOUNT) FROM Bonus GROUP BY WORKER_REF_ID;

 * sqlite:///trial.db
Done.

[(1, 5000), (2, 3000), (3, 4000), (4, 4500), (5, 3500)]

In [23]:
%sql SELECT MIN(BONUS_AMOUNT) FROM Bonus;

 * sqlite:///trial.db
Done.

[(3000,)]

In [24]:
%sql SELECT MAX(BONUS_AMOUNT) FROM Bonus

 * sqlite:///trial.db
Done.

[(5000,)]

In [25]:
%sql SELECT * FROM Bonus

 * sqlite:///trial.db
Done.

[(1, 5000, '16-02-20'),
 (2, 3000, '16=06-11'),
 (3, 4000, '16-02-16'),
 (4, 4500, '16-02-20'),
 (5, 3500, '16-07-23')]

In [26]:
%sql SELECT * FROM Title

 * sqlite:///trial.db
Done.

[(1, 'Manager', '2016-02-20 00.00.00'),
 (2, 'Manager', '2016-06-11 00.00.00'),
 (8, 'Executive', '2016-06-11 00.00.00'),
 (5, 'Executive', '2016-06-11 00.00.00'),
 (4, 'ASS. Manager', '2016-06-11 00.00.00'),
 (7, 'Executive', '2016-06-11 00.00.00'),
 (6, 'Lead', '2016-06-11 00.00.00'),
 (3, 'Lead', '2016-06-11 00.00.00')]

In [27]:
%sql SELECT * FROM Worker

 * sqlite:///trial.db
Done.

[(1, 'Jane', 'Nyamai', 100000, '12-02-24 09.00.00', 'HR'),
 (2, 'Victor', 'Korat', 80000, '11-04-23 09.00.00', 'Account'),
 (3, 'James', 'Tabuke', 300000, '13-05-20 09.00.00', 'Admin'),
 (4, 'Amara', 'tahid', 500000, '14-02-20 09.00.00', 'HR'),
 (5, 'John', 'Doe', 500000, '14-07-18 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '12-08-21 09.00.00', 'Account'),
 (8, 'Vivek', 'Bhati', 90000, '14-09-15 09.00.00', 'Admin')]

In [30]:
%%sql SELECT *
FROM worker
LEFT JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;

 * sqlite:///trial.db
Done.

[(1, 'Jane', 'Nyamai', 100000, '12-02-24 09.00.00', 'HR', 1, 5000, '16-02-20'),
 (2, 'Victor', 'Korat', 80000, '11-04-23 09.00.00', 'Account', 2, 3000, '16=06-11'),
 (3, 'James', 'Tabuke', 300000, '13-05-20 09.00.00', 'Admin', 3, 4000, '16-02-16'),
 (4, 'Amara', 'tahid', 500000, '14-02-20 09.00.00', 'HR', 4, 4500, '16-02-20'),
 (5, 'John', 'Doe', 500000, '14-07-18 09.00.00', 'Admin', 5, 3500, '16-07-23'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account', None, None, None),
 (7, 'Satish', 'Kumar', 75000, '12-08-21 09.00.00', 'Account', None, None, None),
 (8, 'Vivek', 'Bhati', 90000, '14-09-15 09.00.00', 'Admin', None, None, None)]

In [31]:
%%sql SELECT *
FROM Bonus
LEFT JOIN Worker ON Bonus.WORKER_REF_ID = Worker.WORKER_ID

 * sqlite:///trial.db
Done.

[(1, 5000, '16-02-20', 1, 'Jane', 'Nyamai', 100000, '12-02-24 09.00.00', 'HR'),
 (2, 3000, '16=06-11', 2, 'Victor', 'Korat', 80000, '11-04-23 09.00.00', 'Account'),
 (3, 4000, '16-02-16', 3, 'James', 'Tabuke', 300000, '13-05-20 09.00.00', 'Admin'),
 (4, 4500, '16-02-20', 4, 'Amara', 'tahid', 500000, '14-02-20 09.00.00', 'HR'),
 (5, 3500, '16-07-23', 5, 'John', 'Doe', 500000, '14-07-18 09.00.00', 'Admin')]

In [32]:
%%sql
SELECT *
FROM worker
RIGHT JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;

 * sqlite:///trial.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT *
FROM worker
RIGHT JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [33]:
%%sql SELECT *
FROM Worker
INNER JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;

 * sqlite:///trial.db
Done.

[(1, 'Jane', 'Nyamai', 100000, '12-02-24 09.00.00', 'HR', 1, 5000, '16-02-20'),
 (2, 'Victor', 'Korat', 80000, '11-04-23 09.00.00', 'Account', 2, 3000, '16=06-11'),
 (3, 'James', 'Tabuke', 300000, '13-05-20 09.00.00', 'Admin', 3, 4000, '16-02-16'),
 (4, 'Amara', 'tahid', 500000, '14-02-20 09.00.00', 'HR', 4, 4500, '16-02-20'),
 (5, 'John', 'Doe', 500000, '14-07-18 09.00.00', 'Admin', 5, 3500, '16-07-23')]